source/food/chicken-shawarma.org

* Marinade

- 8 garlic cloves
- 1 shallot
- 6 tbsp olive oil
- 2 tbsp cumin
- 2 tbsp coriander
- 1 tbsp sumac
- 1 tsp paprika
- 1 tsp turmeric
- 1 tsp allspice
- 1 tsp ground ginger
- 1/2 tsp cinnamon
- 1/2 tsp cardamom
- 2 1/2 tsp salt
- add yogurt as desired


* Cook
1. Preheat oven to 400 degrees F.
2. Cook chicken for roughly 20 minutes, flipping halfway through.
3. Heat up a skillet, add olive oil, and sear/cook the chicken as desired.


* Halal cart style white sauce
I think I got this recipe somewhere on reddit probably.

- 1/2 cup plain yogurt
- 1/3 cup mayonnaise
- 1 tbsp distilled white vinegar
- 2 tbsp water
- 2 tbsp lemon juice
- 2 tsp sugar
- 2 tsp parsley
- 1/4 tsp pepper
- 1/4 tsp salt


Hand-whisk until you get tired, and then transfer it into a squeeze bottle. 
