docs/food/chicken-shawarma.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chicken Shawarma</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="."> UP </a>
 |
 <a accesskey="H" href="../.."> HOME </a>
</div><div id="content" class="content">

<div id="outline-container-orgc330024" class="outline-2">
<h2 id="orgc330024">Chicken Shawarma</h2>
<div class="outline-text-2" id="text-orgc330024">
</div>
<div id="outline-container-orgdce39e3" class="outline-3">
<h3 id="orgdce39e3">Marinade</h3>
<div class="outline-text-3" id="text-orgdce39e3">
<ul class="org-ul">
<li>8 garlic cloves</li>
<li>1 shallot</li>
<li>6 tbsp olive oil</li>
<li>2 tbsp cumin</li>
<li>2 tbsp coriander</li>
<li>1 tbsp sumac</li>
<li>1 tsp paprika</li>
<li>1 tsp turmeric</li>
<li>1 tsp allspice</li>
<li>1 tsp ground ginger</li>
<li>1/2 tsp cinnamon</li>
<li>1/2 tsp cardamom</li>
<li>2 1/2 tsp salt</li>
<li>add yogurt as desired</li>
</ul>
</div>
</div>


<div id="outline-container-orgd67099b" class="outline-3">
<h3 id="orgd67099b">Cook</h3>
<div class="outline-text-3" id="text-orgd67099b">
<ol class="org-ol">
<li>Preheat oven to 400 degrees F.</li>
<li>Cook chicken for roughly 20 minutes, flipping halfway through.</li>
<li>Heat up a skillet, add olive oil, and sear/cook the chicken as desired.</li>
</ol>
</div>
</div>


<div id="outline-container-org94e8456" class="outline-3">
<h3 id="org94e8456">Halal cart style white sauce</h3>
<div class="outline-text-3" id="text-org94e8456">
<p>
I think I got this recipe somewhere on reddit probably.
</p>

<ul class="org-ul">
<li>1/2 cup plain yogurt</li>
<li>1/3 cup mayonnaise</li>
<li>1 tbsp distilled white vinegar</li>
<li>2 tbsp water</li>
<li>2 tbsp lemon juice</li>
<li>2 tsp sugar</li>
<li>2 tsp parsley</li>
<li>1/4 tsp pepper</li>
<li>1/4 tsp salt</li>
</ul>


<p>
Hand-whisk until you get tired, and then transfer it into a squeeze bottle. 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
